---
title: MEPSection
classe: Autodesk.Revit.DB.Mechanical.MEPSection
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# MEPSection

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double FixtureUnit { get; }` | `mEPSection.FixtureUnit` | Double |
| `Double Flow { get; }` | `mEPSection.Flow` | Double |
| `Double Friction { get; }` | `mEPSection.Friction` | Double |
| `Double FrictionFactor { get; }` | `mEPSection.FrictionFactor` | Double |
| `Boolean IsValidObject { get; }` | `mEPSection.IsValidObject` | Boolean |
| `Int32 Number { get; }` | `mEPSection.Number` | Int32 |
| `Double ReynoldsNumber { get; }` | `mEPSection.ReynoldsNumber` | Double |
| `Double Roughness { get; }` | `mEPSection.Roughness` | Double |
| `Double TotalCoefficient { get; }` | `mEPSection.TotalCoefficient` | Double |
| `Double TotalCurveLength { get; }` | `mEPSection.TotalCurveLength` | Double |
| `Double TotalPressureLoss { get; }` | `mEPSection.TotalPressureLoss` | Double |
| `Double Velocity { get; }` | `mEPSection.Velocity` | Double |
| `Double VelocityPressure { get; }` | `mEPSection.VelocityPressure` | Double |
| `Void Dispose()` | `mEPSection.Dispose()` | Void |
| `Double GetCoefficient(ElementId)` | `mEPSection.GetCoefficient(elemId)` | Double |
| `IList<ElementId> GetElementIds()` | `mEPSection.GetElementIds()` | IList<ElementId> |
| `Double GetPressureDrop(ElementId)` | `mEPSection.GetPressureDrop(elemId)` | Double |
| `Double GetSegmentLength(ElementId)` | `mEPSection.GetSegmentLength(segmentId)` | Double |
| `Boolean IsMain(ElementId)` | `mEPSection.IsMain(fittingId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```